phanchinh2k3/bai_buoi_5/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT1_10 (number 4), led1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_led1_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_led1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_led1_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_led1_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_led1_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_led1_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_led1_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT1_12 (number 6), led2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_led2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_led2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_led2_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_led2_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_led2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_led2_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_led2_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
